LA7LKA/AmateurRadioDMRRepeater/software/SiLabs/Si446x_EmptyFramework/src/drivers/C8051F930_defs_add.h
// SFR Definition   12.7.  IT01CF:  INT0/ INT1 Configuration
#define   B_IN1PL        7         // INT1 Polarity.
#define   M_IN1PL        0x80      // INT1 Polarity.
#define   BF_IN1SL       4         // INT1 Port Pin Se lection Bits.
#define   BF_IN1SL_0     4         // INT1 Port Pin Se lection Bits.
#define   BF_IN1SL_1     5         // INT1 Port Pin Se lection Bits.
#define   BF_IN1SL_2     6         // INT1 Port Pin Se lection Bits.
#define   M_IN1SL        0x70      // INT1 Port Pin Se lection Bits.
#define   B_IN0PL        3         // INT0 Polarity.
#define   M_IN0PL        0x08      // INT0 Polarity.
#define   BF_IN0SL       0         // INT0 Port Pin Se lection Bits.
#define   BF_IN0SL_0     0         // INT0 Port Pin Se lection Bits.
#define   BF_IN0SL_1     1         // INT0 Port Pin Se lection Bits.
#define   BF_IN0SL_2     2         // INT0 Port Pin Se lection Bits.
#define   M_IN0SL        0x07      // INT0 Port Pin Se lection Bits.

// SFR Definition   13.1.  PSCTL: Program Store R/W Control
#define   B_SFLE         2         // Scratchpad Flash Memory Access Enable.
#define   M_SFLE         0x04      // Scratchpad Flash Memory Access Enable.
#define   B_PSEE         1         // Program Store Erase Enable.
#define   M_PSEE         0x02      // Program Store Erase Enable.
#define   B_PSWE         0         // Program Store Write Enable.
#define   M_PSWE         0x01      // Program Store Write Enable.

// SFR Definition   13.3.  FLSCL: Flash Scale
#define   B_BYPASS       6         // Flash Read Timing One-Shot Bypass.
#define   M_BYPASS       0x40      // Flash Read Timing One-Shot Bypass.

// SFR Definition   14.1.  PMU0CF: Power Management Unit Configuration
#define   B_SLEEP        7         // Sleep Mode Select Writing 1 places the
#define   M_SLEEP        0x80      // Sleep Mode Select Writing 1 places the
#define   B_SUSPEND      6         // Suspend Mode Select Writing 1 places the
#define   M_SUSPEND      0x40      // Suspend Mode Select Writing 1 places the
#define   B_CLEAR        5         // Wake-up Flag Clear Writing 1 clears all wake-up flags.
#define   M_CLEAR        0x20      // Wake-up Flag Clear Writing 1 clears all wake-up flags.
#define   B_RSTWK        4         // Reset Pin Wake-up Flag N/A Set to 1 if a glitch has
#define   M_RSTWK        0x10      // Reset Pin Wake-up Flag N/A Set to 1 if a glitch has
#define   B_RTCFWK       3         // SmaRTClock Oscillator
#define   M_RTCFWK       0x08      // SmaRTClock Oscillator
#define   B_RTCAWK       2         // SmaRTClock Alarm
#define   M_RTCAWK       0x04      // SmaRTClock Alarm
#define   B_PMATWK       1         // Port Match Wake-up
#define   M_PMATWK       0x02      // Port Match Wake-up
#define   B_CPT0WK       0         // Comparator0 Wake-up
#define   M_CPT0WK       0x01      // Comparator0 Wake-up

// SFR Definition   14.2.  PCON: Power Manageme nt Control Register
#define   BF_GF          2         // General Purpose Flags Sets the logic value. Returns the logic value.
#define   BF_GF_0        2         // General Purpose Flags Sets the logic value. Returns the logic value.
#define   BF_GF_1        3         // General Purpose Flags Sets the logic value. Returns the logic value.
#define   BF_GF_2        4         // General Purpose Flags Sets the logic value. Returns the logic value.
#define   BF_GF_3        5         // General Purpose Flags Sets the logic value. Returns the logic value.
#define   BF_GF_4        6         // General Purpose Flags Sets the logic value. Returns the logic value.
#define   BF_GF_5        7         // General Purpose Flags Sets the logic value. Returns the logic value.
#define   M_GF           0xFC      // General Purpose Flags Sets the logic value. Returns the logic value.
#define   B_STOP         1         // Stop Mode Select Writing 1 places the
#define   M_STOP         0x02      // Stop Mode Select Writing 1 places the
#define   B_IDLE         0         // Idle Mode Select Writing 1 places the
#define   M_IDLE         0x01      // Idle Mode Select Writing 1 places the

// SFR Definition   15.1.  CRC0CN: CRC0 Control
#define   B_CRC0SEL      4         // CRC0 Polynomial Select Bit.
#define   M_CRC0SEL      0x10      // CRC0 Polynomial Select Bit.
#define   B_CRC0INIT     3         // CRC0 Result Init ialization Bit.
#define   M_CRC0INIT     0x08      // CRC0 Result Init ialization Bit.
#define   B_CRC0VAL      2         // CRC0 Set Value Initialization Bit.
#define   M_CRC0VAL      0x04      // CRC0 Set Value Initialization Bit.
#define   BF_CRC0PNT     0         // CRC0 Result Pointer.
#define   BF_CRC0PNT_0   0         // CRC0 Result Pointer.
#define   BF_CRC0PNT_1   1         // CRC0 Result Pointer.
#define   M_CRC0PNT      0x03      // CRC0 Result Pointer.

// SFR Definition   15.4.  CRC0AUTO: CRC0 Automatic Control
#define   B_AUTOEN       7         // Automatic CRC Calc ulation Enable.
#define   M_AUTOEN       0x80      // Automatic CRC Calc ulation Enable.
#define   B_CRCDONE      6         // CRCDONE Automatic CRC Calculation Complete.
#define   M_CRCDONE      0x40      // CRCDONE Automatic CRC Calculation Complete.
#define   BF_CRC0ST      0         // Automatic CRC Calculation Starting Flash Sector.
#define   BF_CRC0ST_0    0         // Automatic CRC Calculation Starting Flash Sector.
#define   BF_CRC0ST_1    1         // Automatic CRC Calculation Starting Flash Sector.
#define   BF_CRC0ST_2    2         // Automatic CRC Calculation Starting Flash Sector.
#define   BF_CRC0ST_3    3         // Automatic CRC Calculation Starting Flash Sector.
#define   BF_CRC0ST_4    4         // Automatic CRC Calculation Starting Flash Sector.
#define   BF_CRC0ST_5    5         // Automatic CRC Calculation Starting Flash Sector.
#define   M_CRC0ST       0x3F      // Automatic CRC Calculation Starting Flash Sector.

// SFR Definition   15.5.  CRC0CNT: CRC0 Automatic Flash Sector Count
#define   BF_CRC0CNT     0         // Automatic CRC Calculation Flash Sector Count.
#define   BF_CRC0CNT_0   0         // Automatic CRC Calculation Flash Sector Count.
#define   BF_CRC0CNT_1   1         // Automatic CRC Calculation Flash Sector Count.
#define   BF_CRC0CNT_2   2         // Automatic CRC Calculation Flash Sector Count.
#define   BF_CRC0CNT_3   3         // Automatic CRC Calculation Flash Sector Count.
#define   BF_CRC0CNT_4   4         // Automatic CRC Calculation Flash Sector Count.
#define   BF_CRC0CNT_5   5         // Automatic CRC Calculation Flash Sector Count.
#define   M_CRC0CNT      0x3F      // Automatic CRC Calculation Flash Sector Count.

// SFR Definition   16.1.  DC0CN: DC-DC Converter Control
#define   BF_MINPW       6         // DC- DC Converter Minimum Pulse Width.
#define   BF_MINPW_0     6         // DC- DC Converter Minimum Pulse Width.
#define   BF_MINPW_1     7         // DC- DC Converter Minimum Pulse Width.
#define   M_MINPW        0xC0      // DC- DC Converter Minimum Pulse Width.
#define   B_SWSEL        5         // DC-DC Converter Switch Select.
#define   M_SWSEL        0x20      // DC-DC Converter Switch Select.
#define   B_SYNC         3         // ADC0 Synchronization Enable.
#define   M_SYNC         0x08      // ADC0 Synchronization Enable.
#define   BF_VSEL        0         // DC- DC Converter Output Voltage Select.
#define   BF_VSEL_0      0         // DC- DC Converter Output Voltage Select.
#define   BF_VSEL_1      1         // DC- DC Converter Output Voltage Select.
#define   BF_VSEL_2      2         // DC- DC Converter Output Voltage Select.
#define   M_VSEL         0x07      // DC- DC Converter Output Voltage Select.

// SFR Definition   16.2.  DC0CF: DC-DC Conver ter Configuration
#define   BF_DC0CF_CLKDIV      5         // DC- DC Clock Divider.
#define   BF_DC0CF_CLKDIV_0    5         // DC- DC Clock Divider.
#define   BF_DC0CF_CLKDIV_1    6         // DC- DC Clock Divider.
#define   M_DC0CF_CLKDIV       0x60      // DC- DC Clock Divider.
#define   B_CLKINV       3         // DC- DC Converter Clock Invert.
#define   M_CLKINV       0x08      // DC- DC Converter Clock Invert.
#define   B_ILIMIT       2         // Peak Current Limit Threshold.
#define   M_ILIMIT       0x04      // Peak Current Limit Threshold.
#define   B_VDDSLP       1         // VDD-DC+ Sleep Mode Connection.
#define   M_VDDSLP       0x02      // VDD-DC+ Sleep Mode Connection.
#define   B_DC0CF_CLKSEL       0         // DC- DC Converter Clock Source Select.
#define   M_DC0CF_CLKSEL       0x01      // DC- DC Converter Clock Source Select.

