LA7LKA/AmateurRadioDMRRepeater/software/SiLabs/Si446x_EmptyFramework/src/drivers/C8051F930_defs_add.h
// SFR Definition   17.1.  REG0CN: Voltage Regulator Control
#define   B_OSCBIAS      4         // Precision Oscillator Bias.
#define   M_OSCBIAS      0x10      // Precision Oscillator Bias.

// SFR Definition   18.1.  VDM0CN: VDD/DC+ Supply Monitor Control
#define   B_VDMEN        7         // VDD/DC+ Supply Monitor Enable.
#define   M_VDMEN        0x80      // VDD/DC+ Supply Monitor Enable.
#define   B_VDDSTAT      6         // VDD/DC+ Supply Status.
#define   M_VDDSTAT      0x40      // VDD/DC+ Supply Status.
#define   B_VDDOK        5         // VDD/DC+ Supply Status (Early Warning).
#define   M_VDDOK        0x20      // VDD/DC+ Supply Status (Early Warning).

// SFR Definition   18.2.  RSTSRC: Reset Source
#define   B_RTC0RE       7         // SmaRTClock Reset Enable
#define   M_RTC0RE       0x80      // SmaRTClock Reset Enable
#define   B_FERROR       6         // Flash Error Reset Flag. N/A Set to 1 if Flash
#define   M_FERROR       0x40      // Flash Error Reset Flag. N/A Set to 1 if Flash
#define   B_C0RSEF       5         // Comparator0 Reset Enable
#define   M_C0RSEF       0x20      // Comparator0 Reset Enable
#define   B_SWRSF        4         // Software Reset Force and
#define   M_SWRSF        0x10      // Software Reset Force and
#define   B_WDTRSF       3         // Watchdog Timer Reset Flag. N/A Set to 1 if Watchdog Timer
#define   M_WDTRSF       0x08      // Watchdog Timer Reset Flag. N/A Set to 1 if Watchdog Timer
#define   B_MCDRSF       2         // Missing Clock Detector
#define   M_MCDRSF       0x04      // Missing Clock Detector
#define   B_PORSF        1         // Power-On / Power-Fail
#define   M_PORSF        0x02      // Power-On / Power-Fail
#define   B_PINRSF       0         // HW Pin Reset Flag. N/A Set to 1 if RST pin caused
#define   M_PINRSF       0x01      // HW Pin Reset Flag. N/A Set to 1 if RST pin caused

// SFR Definition   19.1.  CLKSEL: Clock Select
#define   B_CLKRDY       7         // System Clock Divider Clock Ready Flag.
#define   M_CLKRDY       0x80      // System Clock Divider Clock Ready Flag.
#define   BF_CLKDIV      4         // System Clock Divider Bits.
#define   BF_CLKDIV_0    4         // System Clock Divider Bits.
#define   BF_CLKDIV_1    5         // System Clock Divider Bits.
#define   BF_CLKDIV_2    6         // System Clock Divider Bits.
#define   M_CLKDIV       0x70      // System Clock Divider Bits.
#define   BF_CLKSEL      0         // System Clock Select.
#define   BF_CLKSEL_0    0         // System Clock Select.
#define   BF_CLKSEL_1    1         // System Clock Select.
#define   BF_CLKSEL_2    2         // System Clock Select.
#define   M_CLKSEL       0x07      // System Clock Select.

// SFR Definition   19.2.  OSCICN: Internal Oscillator Control
#define   B_IOSCEN       7         // Internal Oscill ator Enable.
#define   M_IOSCEN       0x80      // Internal Oscill ator Enable.
#define   B_IFRDY        6         // Internal Oscillator Frequency Ready Flag.
#define   M_IFRDY        0x40      // Internal Oscillator Frequency Ready Flag.

// SFR Definition   19.3.  OSCICL: Internal Oscillator Calibration
#define   B_SSE          7         // Spread Spectrum Enable.
#define   M_SSE          0x80      // Spread Spectrum Enable.
#define   BF_OSCICL      0         // Internal Oscillator Calibration.
#define   BF_OSCICL_0    0         // Internal Oscillator Calibration.
#define   BF_OSCICL_1    1         // Internal Oscillator Calibration.
#define   BF_OSCICL_2    2         // Internal Oscillator Calibration.
#define   BF_OSCICL_3    3         // Internal Oscillator Calibration.
#define   BF_OSCICL_4    4         // Internal Oscillator Calibration.
#define   BF_OSCICL_5    5         // Internal Oscillator Calibration.
#define   BF_OSCICL_6    6         // Internal Oscillator Calibration.
#define   M_OSCICL       0x7F      // Internal Oscillator Calibration.

// SFR Definition   19.4.  OSCXCN: External Oscillator Control
#define   B_XCLKVLD      7         // External Oscillator Valid Flag.
#define   M_XCLKVLD      0x80      // External Oscillator Valid Flag.
#define   BF_XOSCMD      4         // External Oscillator Mode Bits.
#define   BF_XOSCMD_0    4         // External Oscillator Mode Bits.
#define   BF_XOSCMD_1    5         // External Oscillator Mode Bits.
#define   BF_XOSCMD_2    6         // External Oscillator Mode Bits.
#define   M_XOSCMD       0x70      // External Oscillator Mode Bits.
#define   BF_XFCN        0         // External Oscillator Frequency Control Bits.
#define   BF_XFCN_0      0         // External Oscillator Frequency Control Bits.
#define   BF_XFCN_1      1         // External Oscillator Frequency Control Bits.
#define   BF_XFCN_2      2         // External Oscillator Frequency Control Bits.
#define   M_XFCN         0x07      // External Oscillator Frequency Control Bits.

// SFR Definition   20.2.  RTC0ADR: SmaRTClock Address
#define   B_RTC0ADR_BUSY         7         // SmaRTClock Interface Busy Indicator.
#define   M_RTC0ADR_BUSY         0x80      // SmaRTClock Interface Busy Indicator.
#define   B_AUTORD       6         // SmaRTClock Interface Autoread Enable.
#define   M_AUTORD       0x40      // SmaRTClock Interface Autoread Enable.
#define   B_SHORT        4         // Short Strobe Enable.
#define   M_SHORT        0x10      // Short Strobe Enable.
#define   BF_ADDR        0         // SmaRTClock Indirect Register Address.
#define   BF_ADDR_0      0         // SmaRTClock Indirect Register Address.
#define   BF_ADDR_1      1         // SmaRTClock Indirect Register Address.
#define   BF_ADDR_2      2         // SmaRTClock Indirect Register Address.
#define   BF_ADDR_3      3         // SmaRTClock Indirect Register Address.
#define   M_ADDR         0x0F      // SmaRTClock Indirect Register Address.

// Internal Register Definition  20.4. RTC0CN: SmaRTClock Control
#define   B_RTC0EN       7         // SmaRTClock Enable.
#define   M_RTC0EN       0x80      // SmaRTClock Enable.
#define   B_MCLKEN       6         // Missing SmaRTClock Detector Enable.
#define   M_MCLKEN       0x40      // Missing SmaRTClock Detector Enable.
#define   B_OSCFAIL      5         // SmaRTClock Oscillator Fail Event Flag.
#define   M_OSCFAIL      0x20      // SmaRTClock Oscillator Fail Event Flag.
#define   B_RTC0TR       4         // SmaRTClock Timer Run Control.
#define   M_RTC0TR       0x10      // SmaRTClock Timer Run Control.
#define   B_RTC0AEN      3         // SmaRTClock Alarm Enable.
#define   M_RTC0AEN      0x08      // SmaRTClock Alarm Enable.
#define   B_ALRM         2         // SmaRTClock Alarm Event
#define   M_ALRM         0x04      // SmaRTClock Alarm Event
#define   B_RTC0SET      1         // SmaRTClock Timer Set.
#define   M_RTC0SET      0x02      // SmaRTClock Timer Set.
#define   B_RTC0CAP      0         // SmaRTClock Timer Capture.
#define   M_RTC0CAP      0x01      // SmaRTClock Timer Capture.

// Internal Register Definition  20.5. RTC0XCN: SmaRTClock Oscillator Control
#define   B_AGCEN        7         // SmaRTClock Oscillator Automatic Gain Control (AGC) Enable.
#define   M_AGCEN        0x80      // SmaRTClock Oscillator Automatic Gain Control (AGC) Enable.
#define   B_BIASX2       5         // SmaRTClock Oscillator Bias Double Enable.
#define   M_BIASX2       0x20      // SmaRTClock Oscillator Bias Double Enable.
#define   B_CLKVLD       4         // SmaRTClock Oscillator Crystal Valid Indicator.
#define   M_CLKVLD       0x10      // SmaRTClock Oscillator Crystal Valid Indicator.

