LA7LKA/AmateurRadioDMRRepeater/software/SiLabs/Si446x_EmptyFramework/src/drivers/C8051F930_defs_add.h
// SFR Definition   24.1.  SPI0CFG: SPI Configuration
#define   B_SPIBSY0       7         // SPI Busy.
#define   M_SPIBSY0       0x80      // SPI Busy.
#define   B_MSTEN0        6         // Master Mode Enable.
#define   M_MSTEN0        0x40      // Master Mode Enable.
#define   B_CKPHA0        5         // SPI Clock Phase.
#define   M_CKPHA0        0x20      // SPI Clock Phase.
#define   B_CKPOL0        4         // SPI Clock Polarity.
#define   M_CKPOL0        0x10      // SPI Clock Polarity.
#define   B_SLVSEL0       3         // Slave Selected Flag.
#define   M_SLVSEL0       0x08      // Slave Selected Flag.
#define   B_NSSIN0        2         // NSS Instantaneous Pin Input.
#define   M_NSSIN0        0x04      // NSS Instantaneous Pin Input.
#define   B_SRMT0         1         // Shift Register Empty (valid in slave mode only).
#define   M_SRMT0         0x02      // Shift Register Empty (valid in slave mode only).
#define   B_RXBMT0        0         // Receive Buffer Empty (valid in slave mode only).
#define   M_RXBMT0        0x01      // Receive Buffer Empty (valid in slave mode only).

// SFR Definition   24.1.  SPI1CFG: SPI Configuration
#define   B_SPIBSY1       7         // SPI Busy.
#define   M_SPIBSY1       0x80      // SPI Busy.
#define   B_MSTEN1        6         // Master Mode Enable.
#define   M_MSTEN1        0x40      // Master Mode Enable.
#define   B_CKPHA1        5         // SPI Clock Phase.
#define   M_CKPHA1        0x20      // SPI Clock Phase.
#define   B_CKPOL1        4         // SPI Clock Polarity.
#define   M_CKPOL1        0x10      // SPI Clock Polarity.
#define   B_SLVSEL1       3         // Slave Selected Flag.
#define   M_SLVSEL1       0x08      // Slave Selected Flag.
#define   B_NSSIN1        2         // NSS Instantaneous Pin Input.
#define   M_NSSIN1        0x04      // NSS Instantaneous Pin Input.
#define   B_SRMT1         1         // Shift Register Empty (valid in slave mode only).
#define   M_SRMT1         0x02      // Shift Register Empty (valid in slave mode only).
#define   B_RXBMT1        0         // Receive Buffer Empty (valid in slave mode only).
#define   M_RXBMT1        0x01      // Receive Buffer Empty (valid in slave mode only).

// SFR Definition   24.2.  SPI0CN: SPI Control
#define   B_SPIF0        7         // SPIn Interrupt Flag.
#define   M_SPIF0        0x80      // SPIn Interrupt Flag.
#define   B_WCOL0        6         // Write Collision Flag.
#define   M_WCOL0        0x40      // Write Collision Flag.
#define   B_MODF0        5         // Mode Fault Flag.
#define   M_MODF0        0x20      // Mode Fault Flag.
#define   B_RXOVRN0      4         // Receive Overrun Flag (valid in slave mode only).
#define   M_RXOVRN0      0x10      // Receive Overrun Flag (valid in slave mode only).
#define   BF_NSS0MD      2         // Slave Select Mode.
#define   BF_NSS0MD_0    2         // Slave Select Mode.
#define   BF_NSS0MD_1    3         // Slave Select Mode.
#define   M_NSS0MD       0x0C      // Slave Select Mode.
#define   B_TXBMT0       1         // Transmit Buffer Empty.
#define   M_TXBMT0       0x02      // Transmit Buffer Empty.
#define   B_SPI0EN       0         // SPIn Enable.
#define   M_SPI0EN       0x01      // SPIn Enable.

// SFR Definition   24.2.  SPI1CN: SPI Control
#define   B_SPIF1        7         // SPIn Interrupt Flag.
#define   M_SPIF1        0x80      // SPIn Interrupt Flag.
#define   B_WCOL1        6         // Write Collision Flag.
#define   M_WCOL1        0x40      // Write Collision Flag.
#define   B_MODF1        5         // Mode Fault Flag.
#define   M_MODF1        0x20      // Mode Fault Flag.
#define   B_RXOVRN1      4         // Receive Overrun Flag (valid in slave mode only).
#define   M_RXOVRN1      0x10      // Receive Overrun Flag (valid in slave mode only).
#define   BF_NSS1MD      2         // Slave Select Mode.
#define   BF_NSS1MD_0    2         // Slave Select Mode.
#define   BF_NSS1MD_1    3         // Slave Select Mode.
#define   M_NSS1MD       0x0C      // Slave Select Mode.
#define   B_TXBMT1       1         // Transmit Buffer Empty.
#define   M_TXBMT1       0x02      // Transmit Buffer Empty.
#define   B_SPI1EN       0         // SPIn Enable.
#define   M_SPI1EN       0x01      // SPIn Enable.

// SFR Definition   25.1.  CKCON: Clock Control
#define   B_T3MH         7         // Timer  3 High Byte Clock Select.
#define   M_T3MH         0x80      // Timer  3 High Byte Clock Select.
#define   B_T3ML         6         // Timer  3 Low Byte Clock Select.
#define   M_T3ML         0x40      // Timer  3 Low Byte Clock Select.
#define   B_T2MH         5         // Timer  2 High Byte Clock Select.
#define   M_T2MH         0x20      // Timer  2 High Byte Clock Select.
#define   B_T2ML         4         // Timer  2 Low Byte Clock Select.
#define   M_T2ML         0x10      // Timer  2 Low Byte Clock Select.
#define   B_T1M          3         // Timer  1 Clock Select.
#define   M_T1M          0x08      // Timer  1 Clock Select.
#define   B_T0M          2         // Timer  0 Clock Select.
#define   M_T0M          0x04      // Timer  0 Clock Select.
#define   BF_SCA         0         // Timer  0/1 Prescale Bits.
#define   BF_SCA_0       0         // Timer  0/1 Prescale Bits.
#define   BF_SCA_1       1         // Timer  0/1 Prescale Bits.
#define   M_SCA          0x03      // Timer  0/1 Prescale Bits.

// SFR Definition   25.2.  TCON: Timer Control
#define   B_TF1          7         // Timer  1 Overflow Flag.
#define   M_TF1          0x80      // Timer  1 Overflow Flag.
#define   B_TR1          6         // Timer  1 Run Control.
#define   M_TR1          0x40      // Timer  1 Run Control.
#define   B_TF0          5         // Timer  0 Overflow Flag.
#define   M_TF0          0x20      // Timer  0 Overflow Flag.
#define   B_TR0          4         // Timer  0 Run Control.
#define   M_TR0          0x10      // Timer  0 Run Control.
#define   B_IE1          3         // External Interrupt 1.
#define   M_IE1          0x08      // External Interrupt 1.
#define   B_IT1          2         // Interrupt 1 Type Select.
#define   M_IT1          0x04      // Interrupt 1 Type Select.
#define   B_IE0          1         // External Interrupt 0.
#define   M_IE0          0x02      // External Interrupt 0.
#define   B_IT0          0         // Interrupt 0 Type Select.
#define   M_IT0          0x01      // Interrupt 0 Type Select.

// SFR Definition   25.3.  TMOD: Timer Mode
#define   B_GATE1        7         // Timer  1 Gate Control.
#define   M_GATE1        0x80      // Timer  1 Gate Control.
#define   BF_TMOD_T1M         4         // Timer  1 Mode Select.
#define   BF_TMOD_T1M_0       4         // Timer  1 Mode Select.
#define   BF_TMOD_T1M_1       5         // Timer  1 Mode Select.
#define   M_TMOD_T1M          0x30      // Timer  1 Mode Select.
#define   B_GATE0        3         // Timer  0 Gate Control.
#define   M_GATE0        0x08      // Timer  0 Gate Control.
#define   BF_TMOD_T0M         0         // Timer  0 Mode Select.
#define   BF_TMOD_T0M_0       0         // Timer  0 Mode Select.
#define   BF_TMOD_T0M_1       1         // Timer  0 Mode Select.
#define   M_TMOD_T0M          0x03      // Timer  0 Mode Select.

// SFR Definition   25.8.  TMR2CN: Timer 2 Control
#define   B_TF2H         7         // Timer  2 High Byte Overflow Flag.
#define   M_TF2H         0x80      // Timer  2 High Byte Overflow Flag.
#define   B_TF2L         6         // Timer  2 Low Byte Overflow Flag.
#define   M_TF2L         0x40      // Timer  2 Low Byte Overflow Flag.
#define   B_TF2LEN       5         // Timer  2 Low Byte Interrupt Enable.
#define   M_TF2LEN       0x20      // Timer  2 Low Byte Interrupt Enable.
#define   B_TF2CEN       4         // Timer  2 Capture Enable.
#define   M_TF2CEN       0x10      // Timer  2 Capture Enable.
#define   B_T2SPLIT      3         // Timer  2 Split Mode Enable.
#define   M_T2SPLIT      0x08      // Timer  2 Split Mode Enable.
#define   B_TR2          2         // Timer  2 Run Control.
#define   M_TR2          0x04      // Timer  2 Run Control.
#define   BF_T2XCLK      0         // Timer  2 External Clock Select.
#define   BF_T2XCLK_0    0         // Timer  2 External Clock Select.
#define   BF_T2XCLK_1    1         // Timer  2 External Clock Select.
#define   M_T2XCLK       0x03      // Timer  2 External Clock Select.

// SFR Definition   25.13.   TMR3CN: Timer 3 Control
#define   B_TF3H         7         // Timer  3 High Byte Overflow Flag.
#define   M_TF3H         0x80      // Timer  3 High Byte Overflow Flag.
#define   B_TF3L         6         // Timer  3 Low Byte Overflow Flag.
#define   M_TF3L         0x40      // Timer  3 Low Byte Overflow Flag.
#define   B_TF3LEN       5         // Timer  3 Low Byte Interrupt Enable.
#define   M_TF3LEN       0x20      // Timer  3 Low Byte Interrupt Enable.
#define   B_TF3CEN       4         // Timer  3 Comparator  1/External Oscillator Capture Enable.
#define   M_TF3CEN       0x10      // Timer  3 Comparator  1/External Oscillator Capture Enable.
#define   B_T3SPLIT      3         // Timer  3 Split Mode Enable.
#define   M_T3SPLIT      0x08      // Timer  3 Split Mode Enable.
#define   B_TR3          2         // Timer  3 Run Control.
#define   M_TR3          0x04      // Timer  3 Run Control.
#define   BF_T3XCLK      0         // Timer  3 External Clock Select.
#define   BF_T3XCLK_0    0         // Timer  3 External Clock Select.
#define   BF_T3XCLK_1    1         // Timer  3 External Clock Select.
#define   M_T3XCLK       0x03      // Timer  3 External Clock Select.

// SFR Definition   26.1.  PCA0CN: PCA Control
#define   B_CF           7         // PCA Counter/Timer Overflow Flag.
#define   M_CF           0x80      // PCA Counter/Timer Overflow Flag.
#define   B_CR           6         // PCA Counter/Timer Run Control.
#define   M_CR           0x40      // PCA Counter/Timer Run Control.
#define   BF_CCF         0         // PCA Module n Capture/Compare Flag.
#define   BF_CCF_0       0         // PCA Module n Capture/Compare Flag.
#define   BF_CCF_1       1         // PCA Module n Capture/Compare Flag.
#define   BF_CCF_2       2         // PCA Module n Capture/Compare Flag.
#define   BF_CCF_3       3         // PCA Module n Capture/Compare Flag.
#define   BF_CCF_4       4         // PCA Module n Capture/Compare Flag.
#define   BF_CCF_5       5         // PCA Module n Capture/Compare Flag.
#define   M_CCF          0x3F      // PCA Module n Capture/Compare Flag.

// SFR Definition   26.2.  PCA0MD: PCA Mode
#define   B_CIDL         7         // PCA Counter/Timer Idle Control.
#define   M_CIDL         0x80      // PCA Counter/Timer Idle Control.
#define   B_WDTE         6         // Watchdog Timer Enable.
#define   M_WDTE         0x40      // Watchdog Timer Enable.
#define   B_WDLCK        5         // Watchdog Timer Lock.
#define   M_WDLCK        0x20      // Watchdog Timer Lock.
#define   BF_CPS         1         // PCA Counter/Timer Pulse Select.
#define   BF_CPS_0       1         // PCA Counter/Timer Pulse Select.
#define   BF_CPS_1       2         // PCA Counter/Timer Pulse Select.
#define   BF_CPS_2       3         // PCA Counter/Timer Pulse Select.
#define   M_CPS          0x0E      // PCA Counter/Timer Pulse Select.
#define   B_ECF          0         // PCA Counter/Timer Overflow Interrupt Enable.
#define   M_ECF          0x01      // PCA Counter/Timer Overflow Interrupt Enable.

